/* automatically generated by rust-bindgen 0.72.1 */

pub type wchar_t = ::std::os::raw::c_int;
pub type uint_least32_t = u32;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Cvc5Kind {
    CVC5_KIND_INTERNAL_KIND = -2,
    CVC5_KIND_UNDEFINED_KIND = -1,
    CVC5_KIND_NULL_TERM = 0,
    CVC5_KIND_UNINTERPRETED_SORT_VALUE = 1,
    CVC5_KIND_EQUAL = 2,
    CVC5_KIND_DISTINCT = 3,
    CVC5_KIND_CONSTANT = 4,
    CVC5_KIND_VARIABLE = 5,
    CVC5_KIND_SKOLEM = 6,
    CVC5_KIND_SEXPR = 7,
    CVC5_KIND_LAMBDA = 8,
    CVC5_KIND_WITNESS = 9,
    CVC5_KIND_CONST_BOOLEAN = 10,
    CVC5_KIND_NOT = 11,
    CVC5_KIND_AND = 12,
    CVC5_KIND_IMPLIES = 13,
    CVC5_KIND_OR = 14,
    CVC5_KIND_XOR = 15,
    CVC5_KIND_ITE = 16,
    CVC5_KIND_APPLY_UF = 17,
    CVC5_KIND_CARDINALITY_CONSTRAINT = 18,
    CVC5_KIND_HO_APPLY = 19,
    CVC5_KIND_ADD = 20,
    CVC5_KIND_MULT = 21,
    CVC5_KIND_IAND = 22,
    CVC5_KIND_POW2 = 23,
    CVC5_KIND_SUB = 24,
    CVC5_KIND_NEG = 25,
    CVC5_KIND_DIVISION = 26,
    CVC5_KIND_DIVISION_TOTAL = 27,
    CVC5_KIND_INTS_DIVISION = 28,
    CVC5_KIND_INTS_DIVISION_TOTAL = 29,
    CVC5_KIND_INTS_MODULUS = 30,
    CVC5_KIND_INTS_MODULUS_TOTAL = 31,
    CVC5_KIND_ABS = 32,
    CVC5_KIND_POW = 33,
    CVC5_KIND_EXPONENTIAL = 34,
    CVC5_KIND_SINE = 35,
    CVC5_KIND_COSINE = 36,
    CVC5_KIND_TANGENT = 37,
    CVC5_KIND_COSECANT = 38,
    CVC5_KIND_SECANT = 39,
    CVC5_KIND_COTANGENT = 40,
    CVC5_KIND_ARCSINE = 41,

#[doc = " \\verbatim embed:rst:leading-asterisk\n Holds information about a specific option, including its name, its\n aliases, whether the option was explicitly set by the user, and information\n concerning its value.\n It can be obtained via :cpp:func:`cvc5_get_option_info()` and allows for a\n more detailed inspection of options than :cpp:func:`cvc5_get_option()`.\n Union member ``info`` holds any of the following alternatives:\n\n - Neither of the following if the option holds no value (or the value has no\n   native type). In that case, the kind of the option will be denoted as\n   #CVC5_OPTION_INFO_VOID.\n - Struct ``BoolInfo`` if the option is of type ``bool``. It holds the current\n   value and the default value of the option. Option kind is denoted as\n   #CVC5_OPTION_INFO_BOOL.\n - Struct ``StringInfo`` if the option is of type ``const char*``. It holds\n   the current value and the default value of the option. Option kind is\n   denoted as #CVC5_OPTION_INFO_STR.\n - Struct ``IntInfo`` if the option is of type ``int64_t``. It holds the\n   current, default, minimum and maximum value of the option. Option kind is\n   denoted as #CVC5_OPTION_INFO_INT64.\n - Struct ``UIntInfo`` if the option is of type ``uint64_t``. It holds the\n   current, default, minimum and maximum value of the option. Option kind is\n   denoted as #CVC5_OPTION_INFO_UINT64.\n - Struct ``DoubleInfo`` if the option is of type ``double``. It holds the\n   current, default, minimum and maximum value of the option. Option kind is\n   denoted as #CVC5_OPTION_INFO_DOUBLE.\n - Struct ``ModeInfo`` if the option has modes. It holds the current and\n   default valuesof the option, as well as a list of valid modes. Option kind\n   is denoted as #CVC5_OPTION_INFO_MODES.\n\n \\endverbatim\n\n  @note A typedef alias with the same name is also available for convenience."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Cvc5OptionInfo {
    #[doc = " The kind of the option info."]
    pub kind: Cvc5OptionInfoKind,
    #[doc = " The option name"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " The number of option name aliases"]
    pub num_aliases: usize,
    #[doc = " The option name aliases"]
    pub aliases: *mut *const ::std::os::raw::c_char,
    #[doc = " The number of unsupported features"]
    pub num_no_supports: usize,
    #[doc = " The unsupported features"]
    pub no_supports: *mut *const ::std::os::raw::c_char,
    #[doc = " True if the option was explicitly set by the user"]
    pub is_set_by_user: bool,
    #[doc = " True if the option is an expert option\n @warning This field is deprecated and replaced by `category`. It will be\n          removed in a future release."]
    pub is_expert: bool,
    #[doc = " True if the option is a regular option\n @warning This field is deprecated and replaced by `category`. It will be\n          removed in a future release."]
    pub is_regular: bool,
    #[doc = " The category of this option."]
    pub category: Cvc5OptionCategory,
    pub info_bool: Cvc5OptionInfo_BoolInfo,
    pub info_str: Cvc5OptionInfo_StringInfo,
    pub info_int: Cvc5OptionInfo_IntInfo,
    pub info_uint: Cvc5OptionInfo_UIntInfo,
    pub info_double: Cvc5OptionInfo_DoubleInfo,
    pub info_mode: Cvc5OptionInfo_ModeInfo,
    #[doc = " The associated C++ info. For internal use, only."]
    pub d_cpp_info: *mut ::std::os::raw::c_void,
}
#[doc = " Information for boolean option values."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Cvc5OptionInfo_BoolInfo {
    #[doc = " The default value."]
    pub dflt: bool,
    #[doc = " The current value."]
    pub cur: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo_BoolInfo"][::std::mem::size_of::<Cvc5OptionInfo_BoolInfo>() - 2usize];
    ["Alignment of Cvc5OptionInfo_BoolInfo"]
        [::std::mem::align_of::<Cvc5OptionInfo_BoolInfo>() - 1usize];
    ["Offset of field: Cvc5OptionInfo_BoolInfo::dflt"]
        [::std::mem::offset_of!(Cvc5OptionInfo_BoolInfo, dflt) - 0usize];
    ["Offset of field: Cvc5OptionInfo_BoolInfo::cur"]
        [::std::mem::offset_of!(Cvc5OptionInfo_BoolInfo, cur) - 1usize];
};
#[doc = " Information for string option values."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Cvc5OptionInfo_StringInfo {
    #[doc = " The default value."]
    pub dflt: *const ::std::os::raw::c_char,
    #[doc = " The current value."]
    pub cur: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo_StringInfo"]
        [::std::mem::size_of::<Cvc5OptionInfo_StringInfo>() - 16usize];
    ["Alignment of Cvc5OptionInfo_StringInfo"]
        [::std::mem::align_of::<Cvc5OptionInfo_StringInfo>() - 8usize];
    ["Offset of field: Cvc5OptionInfo_StringInfo::dflt"]
        [::std::mem::offset_of!(Cvc5OptionInfo_StringInfo, dflt) - 0usize];
    ["Offset of field: Cvc5OptionInfo_StringInfo::cur"]
        [::std::mem::offset_of!(Cvc5OptionInfo_StringInfo, cur) - 8usize];
};
impl Default for Cvc5OptionInfo_StringInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Information for int64 values."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Cvc5OptionInfo_IntInfo {
    #[doc = " The default value."]
    pub dflt: i64,
    #[doc = " The current value."]
    pub cur: i64,
    #[doc = " The minimum value."]
    pub min: i64,
    #[doc = " The maximum value."]
    pub max: i64,
    #[doc = " True if option has a minimum value."]
    pub has_min: bool,
    #[doc = " True if option has a maximum value."]
    pub has_max: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo_IntInfo"][::std::mem::size_of::<Cvc5OptionInfo_IntInfo>() - 40usize];
    ["Alignment of Cvc5OptionInfo_IntInfo"]
        [::std::mem::align_of::<Cvc5OptionInfo_IntInfo>() - 8usize];
    ["Offset of field: Cvc5OptionInfo_IntInfo::dflt"]
        [::std::mem::offset_of!(Cvc5OptionInfo_IntInfo, dflt) - 0usize];
    ["Offset of field: Cvc5OptionInfo_IntInfo::cur"]
        [::std::mem::offset_of!(Cvc5OptionInfo_IntInfo, cur) - 8usize];
    ["Offset of field: Cvc5OptionInfo_IntInfo::min"]
        [::std::mem::offset_of!(Cvc5OptionInfo_IntInfo, min) - 16usize];
    ["Offset of field: Cvc5OptionInfo_IntInfo::max"]
        [::std::mem::offset_of!(Cvc5OptionInfo_IntInfo, max) - 24usize];
    ["Offset of field: Cvc5OptionInfo_IntInfo::has_min"]
        [::std::mem::offset_of!(Cvc5OptionInfo_IntInfo, has_min) - 32usize];
    ["Offset of field: Cvc5OptionInfo_IntInfo::has_max"]
        [::std::mem::offset_of!(Cvc5OptionInfo_IntInfo, has_max) - 33usize];
};
#[doc = " Information for uint64 values."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Cvc5OptionInfo_UIntInfo {
    #[doc = " The default value."]
    pub dflt: u64,
    #[doc = " The current value."]
    pub cur: u64,
    #[doc = " The minimum value."]
    pub min: u64,
    #[doc = " The maximum value."]
    pub max: u64,
    #[doc = " True if option has a minimum value."]
    pub has_min: bool,
    #[doc = " True if option has a maximum value."]
    pub has_max: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo_UIntInfo"][::std::mem::size_of::<Cvc5OptionInfo_UIntInfo>() - 40usize];
    ["Alignment of Cvc5OptionInfo_UIntInfo"]
        [::std::mem::align_of::<Cvc5OptionInfo_UIntInfo>() - 8usize];
    ["Offset of field: Cvc5OptionInfo_UIntInfo::dflt"]
        [::std::mem::offset_of!(Cvc5OptionInfo_UIntInfo, dflt) - 0usize];
    ["Offset of field: Cvc5OptionInfo_UIntInfo::cur"]
        [::std::mem::offset_of!(Cvc5OptionInfo_UIntInfo, cur) - 8usize];
    ["Offset of field: Cvc5OptionInfo_UIntInfo::min"]
        [::std::mem::offset_of!(Cvc5OptionInfo_UIntInfo, min) - 16usize];
    ["Offset of field: Cvc5OptionInfo_UIntInfo::max"]
        [::std::mem::offset_of!(Cvc5OptionInfo_UIntInfo, max) - 24usize];
    ["Offset of field: Cvc5OptionInfo_UIntInfo::has_min"]
        [::std::mem::offset_of!(Cvc5OptionInfo_UIntInfo, has_min) - 32usize];
    ["Offset of field: Cvc5OptionInfo_UIntInfo::has_max"]
        [::std::mem::offset_of!(Cvc5OptionInfo_UIntInfo, has_max) - 33usize];
};
#[doc = " Information for double values."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Cvc5OptionInfo_DoubleInfo {
    #[doc = " The default value."]
    pub dflt: f64,
    #[doc = " The current value."]
    pub cur: f64,
    #[doc = " The minimum value."]
    pub min: f64,
    #[doc = " The maximum value."]
    pub max: f64,
    #[doc = " True if option has a minimum value."]
    pub has_min: bool,
    #[doc = " True if option has a maximum value."]
    pub has_max: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo_DoubleInfo"]
        [::std::mem::size_of::<Cvc5OptionInfo_DoubleInfo>() - 40usize];
    ["Alignment of Cvc5OptionInfo_DoubleInfo"]
        [::std::mem::align_of::<Cvc5OptionInfo_DoubleInfo>() - 8usize];
    ["Offset of field: Cvc5OptionInfo_DoubleInfo::dflt"]
        [::std::mem::offset_of!(Cvc5OptionInfo_DoubleInfo, dflt) - 0usize];
    ["Offset of field: Cvc5OptionInfo_DoubleInfo::cur"]
        [::std::mem::offset_of!(Cvc5OptionInfo_DoubleInfo, cur) - 8usize];
    ["Offset of field: Cvc5OptionInfo_DoubleInfo::min"]
        [::std::mem::offset_of!(Cvc5OptionInfo_DoubleInfo, min) - 16usize];
    ["Offset of field: Cvc5OptionInfo_DoubleInfo::max"]
        [::std::mem::offset_of!(Cvc5OptionInfo_DoubleInfo, max) - 24usize];
    ["Offset of field: Cvc5OptionInfo_DoubleInfo::has_min"]
        [::std::mem::offset_of!(Cvc5OptionInfo_DoubleInfo, has_min) - 32usize];
    ["Offset of field: Cvc5OptionInfo_DoubleInfo::has_max"]
        [::std::mem::offset_of!(Cvc5OptionInfo_DoubleInfo, has_max) - 33usize];
};
#[doc = " Information for mode option values."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Cvc5OptionInfo_ModeInfo {
    #[doc = " The default value."]
    pub dflt: *const ::std::os::raw::c_char,
    #[doc = " The current value."]
    pub cur: *const ::std::os::raw::c_char,
    #[doc = " The number of possible modes."]
    pub num_modes: usize,
    #[doc = " The possible modes."]
    pub modes: *mut *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo_ModeInfo"][::std::mem::size_of::<Cvc5OptionInfo_ModeInfo>() - 32usize];
    ["Alignment of Cvc5OptionInfo_ModeInfo"]
        [::std::mem::align_of::<Cvc5OptionInfo_ModeInfo>() - 8usize];
    ["Offset of field: Cvc5OptionInfo_ModeInfo::dflt"]
        [::std::mem::offset_of!(Cvc5OptionInfo_ModeInfo, dflt) - 0usize];
    ["Offset of field: Cvc5OptionInfo_ModeInfo::cur"]
        [::std::mem::offset_of!(Cvc5OptionInfo_ModeInfo, cur) - 8usize];
    ["Offset of field: Cvc5OptionInfo_ModeInfo::num_modes"]
        [::std::mem::offset_of!(Cvc5OptionInfo_ModeInfo, num_modes) - 16usize];
    ["Offset of field: Cvc5OptionInfo_ModeInfo::modes"]
        [::std::mem::offset_of!(Cvc5OptionInfo_ModeInfo, modes) - 24usize];
};
impl Default for Cvc5OptionInfo_ModeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5OptionInfo"][::std::mem::size_of::<Cvc5OptionInfo>() - 240usize];
    ["Alignment of Cvc5OptionInfo"][::std::mem::align_of::<Cvc5OptionInfo>() - 8usize];
    ["Offset of field: Cvc5OptionInfo::kind"]
        [::std::mem::offset_of!(Cvc5OptionInfo, kind) - 0usize];
    ["Offset of field: Cvc5OptionInfo::name"]
        [::std::mem::offset_of!(Cvc5OptionInfo, name) - 8usize];
    ["Offset of field: Cvc5OptionInfo::num_aliases"]
        [::std::mem::offset_of!(Cvc5OptionInfo, num_aliases) - 16usize];
    ["Offset of field: Cvc5OptionInfo::aliases"]
        [::std::mem::offset_of!(Cvc5OptionInfo, aliases) - 24usize];
    ["Offset of field: Cvc5OptionInfo::num_no_supports"]
        [::std::mem::offset_of!(Cvc5OptionInfo, num_no_supports) - 32usize];
    ["Offset of field: Cvc5OptionInfo::no_supports"]
        [::std::mem::offset_of!(Cvc5OptionInfo, no_supports) - 40usize];
    ["Offset of field: Cvc5OptionInfo::is_set_by_user"]
        [::std::mem::offset_of!(Cvc5OptionInfo, is_set_by_user) - 48usize];
    ["Offset of field: Cvc5OptionInfo::is_expert"]
        [::std::mem::offset_of!(Cvc5OptionInfo, is_expert) - 49usize];
    ["Offset of field: Cvc5OptionInfo::is_regular"]
        [::std::mem::offset_of!(Cvc5OptionInfo, is_regular) - 50usize];
    ["Offset of field: Cvc5OptionInfo::category"]
        [::std::mem::offset_of!(Cvc5OptionInfo, category) - 52usize];
    ["Offset of field: Cvc5OptionInfo::info_bool"]
        [::std::mem::offset_of!(Cvc5OptionInfo, info_bool) - 56usize];
    ["Offset of field: Cvc5OptionInfo::info_str"]
        [::std::mem::offset_of!(Cvc5OptionInfo, info_str) - 64usize];
    ["Offset of field: Cvc5OptionInfo::info_int"]
        [::std::mem::offset_of!(Cvc5OptionInfo, info_int) - 80usize];
    ["Offset of field: Cvc5OptionInfo::info_uint"]
        [::std::mem::offset_of!(Cvc5OptionInfo, info_uint) - 120usize];
    ["Offset of field: Cvc5OptionInfo::info_double"]
        [::std::mem::offset_of!(Cvc5OptionInfo, info_double) - 160usize];
    ["Offset of field: Cvc5OptionInfo::info_mode"]
        [::std::mem::offset_of!(Cvc5OptionInfo, info_mode) - 200usize];
    ["Offset of field: Cvc5OptionInfo::d_cpp_info"]
        [::std::mem::offset_of!(Cvc5OptionInfo, d_cpp_info) - 232usize];
};
impl Default for Cvc5OptionInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Get a string representation of a given option info.\n @param info The option info.\n @return The string representation.\n @note The returned char* pointer is only valid until the next call to this\n       function."]
    pub fn cvc5_option_info_to_string(info: *const Cvc5OptionInfo)
    -> *const ::std::os::raw::c_char;
}
#[doc = " A cvc5 plugin.\n\n @note A typedef alias with the same name is also available for convenience."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Cvc5Plugin {
    #[doc = " Call to check, return list of lemmas to add to the SAT solver.\n This method is called periodically, roughly at every SAT decision.\n @param size  The size of the returned array of lemmas.\n @param state The state data for the function, may be NULL.\n @return The vector of lemmas to add to the SAT solver.\n @note This function pointer may be NULL to use the default implementation."]
    pub check: ::std::option::Option<
        unsafe extern "C" fn(
            size: *mut usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *const Cvc5Term,
    >,
    #[doc = " Notify SAT clause, called when `clause` is learned by the SAT solver.\n @param clause The learned clause.\n @param state The state data for the function, may be NULL.\n @note This function pointer may be NULL to use the default implementation."]
    pub notify_sat_clause: ::std::option::Option<
        unsafe extern "C" fn(clause: Cvc5Term, state: *mut ::std::os::raw::c_void),
    >,
    #[doc = " Notify theory lemma, called when `lemma` is sent by a theory solver.\n @param lemma The theory lemma.\n @param state The state data for the function, may be NULL.\n @note This function pointer may be NULL to use the default implementation."]
    pub notify_theory_lemma: ::std::option::Option<
        unsafe extern "C" fn(lemma: Cvc5Term, state: *mut ::std::os::raw::c_void),
    >,
    #[doc = " Get the name of the plugin (for debugging).\n @return The name of the plugin.\n @note This function pointer may NOT be NULL."]
    pub get_name: ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
    #[doc = " The state to pass into `check`."]
    pub d_check_state: *mut ::std::os::raw::c_void,
    #[doc = " The state to pass into `notify_sat_clause`."]
    pub d_notify_sat_clause_state: *mut ::std::os::raw::c_void,
    #[doc = " The state to pass into `notify_theory_lemma`."]
    pub d_notify_theory_lemma_state: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cvc5Plugin"][::std::mem::size_of::<Cvc5Plugin>() - 56usize];
    ["Alignment of Cvc5Plugin"][::std::mem::align_of::<Cvc5Plugin>() - 8usize];
    ["Offset of field: Cvc5Plugin::check"][::std::mem::offset_of!(Cvc5Plugin, check) - 0usize];
    ["Offset of field: Cvc5Plugin::notify_sat_clause"]
        [::std::mem::offset_of!(Cvc5Plugin, notify_sat_clause) - 8usize];
    ["Offset of field: Cvc5Plugin::notify_theory_lemma"]
        [::std::mem::offset_of!(Cvc5Plugin, notify_theory_lemma) - 16usize];
    ["Offset of field: Cvc5Plugin::get_name"]
        [::std::mem::offset_of!(Cvc5Plugin, get_name) - 24usize];
    ["Offset of field: Cvc5Plugin::d_check_state"]
        [::std::mem::offset_of!(Cvc5Plugin, d_check_state) - 32usize];
    ["Offset of field: Cvc5Plugin::d_notify_sat_clause_state"]
        [::std::mem::offset_of!(Cvc5Plugin, d_notify_sat_clause_state) - 40usize];
    ["Offset of field: Cvc5Plugin::d_notify_theory_lemma_state"]
        [::std::mem::offset_of!(Cvc5Plugin, d_notify_theory_lemma_state) - 48usize];
};
impl Default for Cvc5Plugin {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Get the proof rule used by the root step of a given proof.\n @return The proof rule."]
    pub fn cvc5_proof_get_rule(proof: Cvc5Proof) -> Cvc5ProofRule;
}
unsafe extern "C" {
    #[doc = " Get the proof rewrite rule used  by the root step of the proof.\n\n Requires that `cvc5_proof_get_rule()` does not return\n #CVC5_PROOF_RULE_DSL_REWRITE or #CVC5_PROOF_RULE_THEORY_REWRITE.\n\n @param proof The proof.\n @return The proof rewrite rule."]
    pub fn cvc5_proof_get_rewrite_rule(proof: Cvc5Proof) -> Cvc5ProofRewriteRule;
}
unsafe extern "C" {
